In [85]:
# Timestamp, Period and Period Index

import pandas as pd

In [86]:
y = pd.Period('2016')
print(y)
print(y.start_time)
print(y.end_time)

2016
2016-01-01 00:00:00
2016-12-31 23:59:59.999999999

In [87]:
m = pd.Period('2011-1', freq='M')
print(m)
print(m.start_time)
print(m.end_time)
print(m+1)

2011-01
2011-01-01 00:00:00
2011-01-31 23:59:59.999999999
2011-02

In [88]:
d = pd.Period('2016-02-28', freq='D')
print(d)
print(d+1)

2016-02-28
2016-02-29

In [89]:
h = pd.Period('2016-02-28 23:10:00', freq='H')
print(h)
print(h.start_time)
print(h.end_time)
print(h+1)
#or
print(h+pd.offsets.Hour(5))

2016-02-28 23:00
2016-02-28 23:00:00
2016-02-28 23:59:59.999999999
2016-02-29 00:00
2016-02-29 04:00

In [90]:
q = pd.Period('2017Q1')
print(q) # Jan to March
print(q+1)

2017Q1
2017Q2

In [91]:
# for fiscal year

q = pd.Period('2017Q1', freq='Q-JAN') # means year ends in Jan and starts in Feb
print(q)
print(q.start_time)
print((q+3).end_time)

2017Q1
2016-02-01 00:00:00
2017-01-31 23:59:59.999999999

In [92]:
print(q.asfreq('M', how='start'))
print(q.asfreq('M', how='end'))

2016-02
2016-04

In [93]:
q2 = pd.Period('2017Q2', freq='Q-JAN')
q2-q

In [94]:
# Period Index

idx = pd.period_range('2011','2017',freq='Q-DEC')
print(idx)
print(idx[-1].start_time)
print(idx[-1].end_time)

idx = pd.period_range('2014', periods=10, freq='Q-DEC')
print(idx)

PeriodIndex(['2011Q1', '2011Q2', '2011Q3', '2011Q4', '2012Q1', '2012Q2',
             '2012Q3', '2012Q4', '2013Q1', '2013Q2', '2013Q3', '2013Q4',
             '2014Q1', '2014Q2', '2014Q3', '2014Q4', '2015Q1', '2015Q2',
             '2015Q3', '2015Q4', '2016Q1', '2016Q2', '2016Q3', '2016Q4',
             '2017Q1'],
            dtype='period[Q-DEC]')
2017-01-01 00:00:00
2017-03-31 23:59:59.999999999
PeriodIndex(['2014Q1', '2014Q2', '2014Q3', '2014Q4', '2015Q1', '2015Q2',
             '2015Q3', '2015Q4', '2016Q1', '2016Q2'],
            dtype='period[Q-DEC]')

In [95]:
import numpy as np
ps = pd.Series(np.random.randn(len(idx)), idx)
print(ps.index)
print(ps['2011':'2013'])

PeriodIndex(['2014Q1', '2014Q2', '2014Q3', '2014Q4', '2015Q1', '2015Q2',
             '2015Q3', '2015Q4', '2016Q1', '2016Q2'],
            dtype='period[Q-DEC]')
Series([], Freq: Q-DEC, dtype: float64)

In [96]:
pst = ps.to_timestamp()
print(pst)
print(pst.index)

2014-01-01    0.737738
2014-04-01    0.070066
2014-07-01   -0.665009
2014-10-01    1.368555
2015-01-01   -1.374602
2015-04-01   -0.229367
2015-07-01   -1.054128
2015-10-01   -0.190150
2016-01-01   -0.945908
2016-04-01   -2.419953
Freq: QS-OCT, dtype: float64
DatetimeIndex(['2014-01-01', '2014-04-01', '2014-07-01', '2014-10-01',
               '2015-01-01', '2015-04-01', '2015-07-01', '2015-10-01',
               '2016-01-01', '2016-04-01'],
              dtype='datetime64[ns]', freq='QS-OCT')

In [97]:
df = pd.read_csv('F:/Jay/Python/Code Basics Youtube/Pandas/18_wmt.csv')
df

  Line Item  2017Q1  2017Q2  2017Q3  2017Q4  2018Q1
0   Revenue  115904  120854  118179  130936  117542
1  Expenses   86544   89485   87484   97743   87688
2    Profit   29360   31369   30695   33193   29854

In [98]:
df.set_index('Line Item', inplace=True)
df

           2017Q1  2017Q2  2017Q3  2017Q4  2018Q1
Line Item
Revenue    115904  120854  118179  130936  117542
Expenses    86544   89485   87484   97743   87688
Profit      29360   31369   30695   33193   29854

In [101]:
df = df.T #Transform property
df

Line Item  Revenue  Expenses  Profit
2017Q1      115904     86544   29360
2017Q2      120854     89485   31369
2017Q3      118179     87484   30695
2017Q4      130936     97743   33193
2018Q1      117542     87688   29854

In [103]:
df.index = pd.PeriodIndex(df.index, freq='Q-JAN')
df.index

PeriodIndex(['2017Q1', '2017Q2', '2017Q3', '2017Q4', '2018Q1'], dtype='period[Q-JAN]')

In [105]:
df['Start Date'] = df.index.map(lambda x: x.start_time)
df['End Date'] = df.index.map(lambda x: x.end_time)
df

Line Item  Revenue  Expenses  Profit Start Date                      End Date
2017Q1      115904     86544   29360 2016-02-01 2016-04-30 23:59:59.999999999
2017Q2      120854     89485   31369 2016-05-01 2016-07-31 23:59:59.999999999
2017Q3      118179     87484   30695 2016-08-01 2016-10-31 23:59:59.999999999
2017Q4      130936     97743   33193 2016-11-01 2017-01-31 23:59:59.999999999
2018Q1      117542     87688   29854 2017-02-01 2017-04-30 23:59:59.999999999